def test_bigram(text):
    tests = [
        "ГЪ", "КЩ", "ЩФ", "ЩЗ", "ЭЩ", "ЩК", "ГЩ", "ЩП", "ЩТ", "ЩШ", "ЩГ", "ЩМ", "ФЩ", "ЩЛ", "ЩД",
        "ДЩ", "ЧЦ", "ВЙ", "ЙА", "ШЯ", "ШЫ", "ГЮ", "ХЯ", "ЙЫ", "ЦЯ", "ГЬ", "СЙ", "ХЮ", "ЪЖ", "ЪД",
        "УЬ", "ЩЧ", "ЧЙ", "ШЙ", "ШЗ", "ЫФ", "ЖЩ", "ЖШ", "ЖЦ", "ЫЪ", "ЫЭ", "ЫЮ", "ЫЬ", "ЖЙ", "ЫЫ",
        "ЖЪ", "ЖЫ", "ЪШ", "ПЙ", "ЪЩ", "ЗЩ", "ЪЧ", "ЪЦ", "ЪУ", "ЪФ", "ЪХ", "ЪЪ", "ЪЫ", "ЫО", "ЖЯ",
        "ЗЙ", "ЪЬ", "ЪЭ", "ЫА", "НЙ", "ЕЬ", "ЦЙ", "ЬЙ", "ЬЛ", "ЬР", "ПЪ", "ЕЫ", "ЕЪ", "ЬА", "ШЪ",
        "ЪТ", "ЩС", "ОЬ", "КЪ", "ОЫ", "ЩХ", "ЩЩ", "ЩЪ", "ЩЦ", "КЙ", "ОЪ", "ЦЩ", "ЛЪ", "МЙ", "ШЩ",
        "ЦЬ", "ЦЪ", "ЩЙ", "ЙЬ", "ЪГ", "ИЪ", "ЪБ", "ЪВ", "ЪИ", "ЪЙ", "ЪП", "ЪР", "ЪС", "ЪО", "ЪН",
        "ЪК", "ЪЛ", "ЪМ", "ИЫ", "ИЬ", "ЙУ", "ЩЭ", "ЙЫ", "ЙЪ", "ЩЫ", "ЩЮ", "ЩЯ", "ЪА", "МЪ", "ЙЙ",
        "ЙЖ", "ЬУ", "ГЙ", "ЭЪ", "УЪ", "АЬ", "ЧЪ", "ХЙ", "ТЙ", "ЧЩ", "РЪ", "ЮЪ", "ФЪ", "УЫ", "АЪ",
        "ЮЬ", "АЫ", "ЮЫ", "ЭЬ", "ЭЫ", "БЙ", "ЯЬ", "ЬЫ", "ЬЬ", "ЬЪ", "ЯЪ", "ЯЫ", "ХЩ", "ДЙ", "ФЙ"
    ]
    for test in tests:
        if (text.find(test) != -1):
            return False
    return True


def test_freq(text, k):
    frequency = {
        'О': 0.1097, 'Е': 0.0845,
        'А': 0.0801, 'И': 0.0735,
        'Н': 0.0670, 'Т': 0.0626,
        'С': 0.0547, 'Р': 0.0473,
        'В': 0.0454, 'Л': 0.0440,
        'К': 0.0349, 'М': 0.0321,
        'Д': 0.0298, 'П': 0.0281,
        'У': 0.0262, 'Я': 0.0201,
        'Ы': 0.0190, 'Ь': 0.0174,
        'Г': 0.0170, 'З': 0.0165,
        'Б': 0.0159, 'Ч': 0.0144,
        'Й': 0.0121, 'Х': 0.0097,
        'Ж': 0.0094, 'Ш': 0.0073,
        'Ю': 0.0064, 'Ц': 0.0048,
        'Щ': 0.0036, 'Э': 0.0032,
        'Ф': 0.0026, 'Ъ': 0.0004,
        'Ё': 0.0004
    }
    str_freq = {}
    len_txt = len(text)

    for i in range(len_txt):
        str_freq[text[i]] = str_freq.get(text[i], -1) + 1

    summa = 0
    for ch in str_freq:
        if (str_freq[ch] / len_txt > frequency.get(ch, 1)):
            summa += 1
    return k > (summa / len(str_freq))
